; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_7 ?v8 ?v1)
             (pred_12 ?v6 ?v7)
             (pred_5 ?v8 ?v7)
             (pred_11 ?v13 ?v8 )
	     (pred_9 ?v8)
             (pred_1 ?v3)
             (pred_6 ?v6)
             (pred_8 ?v7)
             (pred_10 ?v8)
             (pred_2 ?v6)
             (pred_4 ?v8)
             (pred_3 ))



(:action op_4
:parameters (?v5 ?v12 ?v10 ?v4)
:precondition (and (pred_1 ?v5) (pred_1 ?v12) (pred_6 ?v10) (pred_8 ?v4)
          (pred_7 ?v5 ?v12) (pred_12 ?v10 ?v4)
                   (pred_5 ?v12 ?v4) (pred_9 ?v5) 
                   (pred_10 ?v12) (pred_2 ?v10))
:effect (and  (pred_4 ?v12) (not (pred_10 ?v12))))


(:action op_3
:parameters (?v5 ?v9)
:precondition (and (pred_1 ?v5) (pred_1 ?v9)
               (pred_9 ?v5) (pred_7 ?v5 ?v9) (pred_4 ?v9))
:effect (and (pred_9 ?v9) (not (pred_9 ?v5))))

(:action op_5
:parameters (?v5 ?v10)
:precondition (and (pred_1 ?v5) (pred_6 ?v10) 
                  (pred_9 ?v5) (pred_11 ?v10 ?v5) (pred_3 ))
:effect (and (pred_2 ?v10)
   (not (pred_11 ?v10 ?v5)) (not (pred_3 ))))


(:action op_2
:parameters (?v5 ?v11 ?v2)
:precondition (and (pred_1 ?v5) (pred_6 ?v11) (pred_6 ?v2)
                  (pred_9 ?v5) (pred_2 ?v2) (pred_11 ?v11 ?v5))
:effect (and (pred_2 ?v11) (pred_11 ?v2 ?v5)
        (not (pred_2 ?v2)) (not (pred_11 ?v11 ?v5))))

(:action op_1
:parameters (?v5 ?v10)
:precondition (and (pred_1 ?v5) (pred_6 ?v10) 
                  (pred_9 ?v5) (pred_2 ?v10))
:effect (and (pred_3 ) (pred_11 ?v10 ?v5) (not (pred_2 ?v10)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_18 obj_17 obj_09 obj_13 obj_06 obj_01 obj_03 obj_12 obj_19 obj_07 obj_05 obj_04 obj_20 obj_21 obj_10 obj_14
    obj_08 obj_02
    obj_16 obj_15 obj_11
    )

    (:init
       (pred_3)

       (pred_1 obj_18)
       (pred_1 obj_17)
       (pred_1 obj_09)
       (pred_1 obj_13)
       (pred_1 obj_06)
       (pred_1 obj_01)
       (pred_1 obj_03)
       (pred_1 obj_12)
       (pred_1 obj_19)
       (pred_1 obj_07)
       (pred_1 obj_05)
       (pred_1 obj_04)
       (pred_1 obj_20)
       (pred_1 obj_21)
       (pred_1 obj_10)
       (pred_1 obj_14)
       (pred_8 obj_08)
       (pred_8 obj_02)
       (pred_6 obj_16)
       (pred_6 obj_15)
       (pred_6 obj_11)

       (pred_7 obj_18 obj_06)
       (pred_7 obj_18 obj_17)
       (pred_7 obj_17 obj_01)
       (pred_7 obj_17 obj_09)
       (pred_7 obj_17 obj_18)
       (pred_7 obj_09 obj_03)
       (pred_7 obj_09 obj_13)
       (pred_7 obj_09 obj_17)
       (pred_7 obj_13 obj_12)
       (pred_7 obj_13 obj_09)
       (pred_7 obj_06 obj_19)
       (pred_7 obj_06 obj_01)
       (pred_7 obj_06 obj_18)
       (pred_7 obj_01 obj_07)
       (pred_7 obj_01 obj_03)
       (pred_7 obj_01 obj_17)
       (pred_7 obj_01 obj_06)
       (pred_7 obj_03 obj_05)
       (pred_7 obj_03 obj_12)
       (pred_7 obj_03 obj_09)
       (pred_7 obj_03 obj_01)
       (pred_7 obj_12 obj_04)
       (pred_7 obj_12 obj_13)
       (pred_7 obj_12 obj_03)
       (pred_7 obj_19 obj_20)
       (pred_7 obj_19 obj_07)
       (pred_7 obj_19 obj_06)
       (pred_7 obj_07 obj_21)
       (pred_7 obj_07 obj_05)
       (pred_7 obj_07 obj_01)
       (pred_7 obj_07 obj_19)
       (pred_7 obj_05 obj_10)
       (pred_7 obj_05 obj_04)
       (pred_7 obj_05 obj_03)
       (pred_7 obj_05 obj_07)
       (pred_7 obj_04 obj_14)
       (pred_7 obj_04 obj_12)
       (pred_7 obj_04 obj_05)
       (pred_7 obj_20 obj_21)
       (pred_7 obj_20 obj_19)
       (pred_7 obj_21 obj_10)
       (pred_7 obj_21 obj_07)
       (pred_7 obj_21 obj_20)
       (pred_7 obj_10 obj_14)
       (pred_7 obj_10 obj_05)
       (pred_7 obj_10 obj_21)
       (pred_7 obj_14 obj_04)
       (pred_7 obj_14 obj_10)
       (pred_10 obj_13)
       (pred_10 obj_09)
       (pred_10 obj_20)
       (pred_5  obj_13 obj_08)
       (pred_5  obj_09 obj_02)
       (pred_5  obj_20 obj_02)
       (pred_4 obj_18)
       (pred_4 obj_17)
       (pred_4 obj_06)
       (pred_4 obj_01)
       (pred_4 obj_03)
       (pred_4 obj_12)
       (pred_4 obj_19)
       (pred_4 obj_07)
       (pred_4 obj_05)
       (pred_4 obj_04)
       (pred_4 obj_21)
       (pred_4 obj_10)
       (pred_4 obj_14)

       (pred_12  obj_16 obj_08)
       (pred_12  obj_15 obj_02)
       (pred_12  obj_11 obj_02)
       (pred_11 obj_16 obj_14)
       (pred_11 obj_15 obj_19)
       (pred_11 obj_11 obj_05)
       (pred_9 obj_04)
    )

    (:goal (and
       (pred_11 obj_16 obj_05)
       (pred_11 obj_15 obj_04)
    ))
(:constraints
  (always (not (pred_9 obj_07)))
)
)

; plan
1. (op_3 obj_04 obj_14)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_14)
   goals met: 0 of 2
2. (op_5 obj_14 obj_16)
   deleted: (pred_11 obj_16 obj_14) (pred_3)
   added: (pred_2 obj_16)
   goals met: 0 of 2
3. (op_3 obj_14 obj_04)
   deleted: (pred_9 obj_14)
   added: (pred_9 obj_04)
   goals met: 0 of 2
4. (op_3 obj_04 obj_05)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_05)
   goals met: 0 of 2
5. (op_2 obj_05 obj_11 obj_16)
   deleted: (pred_2 obj_16) (pred_11 obj_11 obj_05)
   added: (pred_2 obj_11) (pred_11 obj_16 obj_05)
   goals met: 1 of 2
6. (op_3 obj_05 obj_10)
   deleted: (pred_9 obj_05)
   added: (pred_9 obj_10)
   goals met: 1 of 2
7. (op_3 obj_10 obj_21)
   deleted: (pred_9 obj_10)
   added: (pred_9 obj_21)
   goals met: 1 of 2
8. (op_4 obj_21 obj_20 obj_11 obj_02)
   deleted: (pred_10 obj_20)
   added: (pred_4 obj_20)
   goals met: 1 of 2
9. (op_3 obj_21 obj_20)
   deleted: (pred_9 obj_21)
   added: (pred_9 obj_20)
   goals met: 1 of 2
10. (op_3 obj_20 obj_19)
   deleted: (pred_9 obj_20)
   added: (pred_9 obj_19)
   goals met: 1 of 2
11. (op_2 obj_19 obj_15 obj_11)
   deleted: (pred_2 obj_11) (pred_11 obj_15 obj_19)
   added: (pred_2 obj_15) (pred_11 obj_11 obj_19)
   goals met: 1 of 2
12. (op_3 obj_19 obj_06)
   deleted: (pred_9 obj_19)
   added: (pred_9 obj_06)
   goals met: 1 of 2
13. (op_3 obj_06 obj_01)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_01)
   goals met: 1 of 2
14. (op_3 obj_01 obj_03)
   deleted: (pred_9 obj_01)
   added: (pred_9 obj_03)
   goals met: 1 of 2
15. (op_3 obj_03 obj_12)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_12)
   goals met: 1 of 2
16. (op_3 obj_12 obj_04)
   deleted: (pred_9 obj_12)
   added: (pred_9 obj_04)
   goals met: 1 of 2
17. (op_1 obj_04 obj_15)
   deleted: (pred_2 obj_15)
   added: (pred_3) (pred_11 obj_15 obj_04)
   goals met: 2 of 2
